[
  {
    "title": "May 10th, 9th Reactivate London Meetup",
    "talks": [
      {
        "avatar": "/static/mattia.png",
        "link": "http://github.com/mattia46",
        "name": "Mattia Assogna",
        "title": "DAZN",
        "text": "Mattia Assogna is a software engineer at DAZN. He is passionate about technology and open source and he is always trying to find a better and more efficient ways to solve problems. Mattia will be speaking about key concepts of Reactive Programming and how MobX and MobX State tree allow you to create a reactive application with no hustle",
        "time": "7:00 PM"
      },
      {
        "avatar": "/static/Jani2.jpg",
        "link": "https://twitter.com/jevakallio",
        "name": "Jani Eväkallio",
        "title": "Formidable",
        "text": "Jani is probably the last person who hasn't yet written a React state management library, but he's got opinions",
        "time": "7:45 PM"
      }
    ]
  },
  {
    "title": "March 26th, 8th Reactivate London Meetup",
    "talks": [
      {
        "avatar": "/static/ian.jpg",
        "link": "https://twitter.com/ianfeather",
        "name": "Ian Feather",
        "title": "Buzzfeed",
        "text": "Ian leads the front end infrastructure team at BuzzFeed working on performance, testing, automation and resilience. He is particularly fond of working on problems relating to scale: both of sites and of teams. ",
        "time": "7:00 PM"
      },
      {
        "avatar": "/static/mariko.jpeg",
        "link": "https://twitter.com/kosamari",
        "name": "Mariko Kosaka",
        "title": "Google",
        "text": "Mariko is a web engineer working at Google who likes to fiddle with browser and yarn. She uses code to help her design textiles and organize a local JavaScript meetup in New York City called BrooklynJS.",
        "time": "8:00 PM"
      }
    ]
  },
  {
    "title": "Dec 7th, 7th Reactivate London Meetup",
    "talks": [
      {
        "avatar": "/static/Claudia.jpg",
        "link": "https://claudiamatosa.com",
        "name": "Claudia Matosa",
        "title": "Oh, frameworks!",
        "text": "What happens to a React developer when they are dropped into an Ember project?",
        "time": "7:00 PM"
      },
      {
        "avatar": "/static/JamesS.jpeg",
        "link": "https://unop.uk/",
        "name": "James Singleton",
        "title": "React + ASP.NET Core = 👍",
        "text": "Learn about ASP.NET Core, Microsoft's cross-platform and open-source web app framework, and how we can integrate a React app with an ASP.NET Core back-end, including server-side pre-rendering!",
        "time": "7:45 PM"
      },
      {
        "avatar": "/static/Paul.jpeg",
        "link": "https://myitcv.io/",
        "name": "Paul Jolly",
        "title": "Go, React, Go!",
        "text": "Let’s learn how we can use the Go programming language to make fast, scalable and maintainable web apps using React! We’ll see some of the benefits including backend code reuse, code generation, fun language tools, and integration with existing backend services.",
        "time": "8:00 PM"
      }
    ]
  },
  {
    "title": "Oct 3rd, 6th Reactivate London Meetup",
    "talks": [
      {
        "avatar": "/static/Mario.jpg",
        "link": "https://twitter.com/realmario",
        "name": "Mario Rogic",
        "title": "Building unbreakable webapps fast: crash course with Elm",
        "text": "Elm is a delightful functional language for reliable web apps. It compiles to JavaScript, has great performance, no runtime exceptions, and can be embeded easily into existing JS projects without the need for huge rewrites or time investment. We'll be taking a practically focused crash course tour of Elm, ideally you'll walk away being able to put Elm into production either from scratch or in an existing project. We'll do our best to have some hands-on hacking together. The audience will also engage interactively with live feedback/reactions powered by the presentation, which is an Elm app itself!",
        "time": "7:40 PM"
      }
    ]
  },
  {
    "title": "Aug 15th, 5th Reactivate London Meetup",
    "talks": [
      {
        "avatar": "/static/Johannes.jpg",
        "link": "https://twitter.com/frostney_",
        "name": "Johannes Stein",
        "title": "Let's develop a React-powered game!",
        "text": "This talk is about React-powered game development where Johannes will be live coding a PIRATE game throughout his talk. With each example he will be implementing a new feature towards a playable prototype.",
        "time": "7:40 PM"
      }
    ]
  },
  {
    "title": "Jun 14th, 4th Reactivate London Meetup",
    "talks": [
      {
        "avatar": "/static/Jani.jpg",
        "link": "https://twitter.com/jevakallio",
        "name": "Jani Eväkallio",
        "title": "React Native Workshop",
        "text": "Ever dreamed about building a native app? Your dream could become a reality, since in this workshop Jani is going to teach you the intricacies of building a React Native app. Let's see if we can build the next unicorn. A Snapchat app... For cats.",
        "time": "6:30 PM"
      }
    ]
  },
  {
    "title": "Apr 27th, 3rd Reactivate London Meetup",
    "talks": [
      {
        "avatar": "/static/Jani.jpg",
        "link": "https://twitter.com/jevakallio",
        "name": "Jani Eväkallio",
        "title": "Redux Offline",
        "text": "How do you go offline with your app? In this talk Jani is going to show you how to utilise Redux Offline, to make your app offline-first. Optimistic updates, background synchronisation, and more...",
        "time": "6:15 PM"
      },
      {
        "avatar": "/static/Marcel.jpg",
        "link": "https://twitter.com/marcelcutts",
        "name": "Marcel Cutts",
        "title": "A pragmatist's guide to ReasonML",
        "text": "What is ReasonML, and why does it seem to keep dripping into our React ecosystem? Is this just one of those crazy hipster things? Should I learn it now, later, or never at all? These questions and more will be answered in this talk.",
        "lightning": true,
        "time": "6:45 PM"
      },
      {
        "avatar": "/static/Tasveer.jpg",
        "link": "http://twitter.com/tazsingh",
        "name": "Tasveer Singh",
        "title": "6 in 1",
        "text": "It's been a dream to support multiple platforms from one codebase, and to abstract their differences in UX to unify development. Taz has uncovered the holy grail of development for Web, Mac, Windows, Linux, iOS, and Android.",
        "lightning": true,
        "time": "7:00 PM"
      }
    ]
  },
  {
    "title": "Mar 27th, 2nd Reactivate London Meetup",
    "talks": [
      {
        "avatar": "/static/Max.jpg",
        "link": "https://twitter.com/mxstbr",
        "name": "Max Stoiber",
        "title": "From CSS Preprocessors to Styled Components",
        "text": "In this lightning talk Max is going to talk about moving from CSS Preprocessors to Styled Components, and how you can achieve more maintainable styling in your React project today.",
        "lightning": true,
        "time": "6:00 PM"
      },
      {
        "avatar": "/static/Ken.jpg",
        "link": "https://twitter.com/ken_wheeler",
        "name": "Ken Wheeler",
        "title": "Spectacle",
        "text": "In this lightning talk Ken is going to show you the awesome Spectacle library for building presentations in React. Furthermore he's going to talk about things that were introduced in the latest version, and things to come.",
        "lightning": true,
        "time": "6:15 PM"
      },
      {
        "avatar": "/static/Michele.jpg",
        "link": "https://twitter.com/MicheleBertoli",
        "name": "Michele Bertoli",
        "title": "jest-styled-components",
        "text": "Michele has recently released a small library that allows you to seamlessly use Styled Components with Jest's snapshot testing. In this lightning talk he's going to demo it.",
        "lightning": true,
        "time": "6:30 PM"
      }
    ]
  },
  {
    "title": "Dec 6th, 1st Reactivate London Meetup",
    "talks": [
      {
        "avatar": "/static/Daniela.jpg",
        "link": "https://twitter.com/sericaia",
        "name": "Daniela Matos de Carvalho",
        "title": "React Fiber",
        "text": "React Fiber is an ongoing reimplementation of React's core algorithm. It is the culmination of over two years of research by the React team. This talk will explain what the main differences are and what the React team is doing to push this forward."
      },
      {
        "avatar": "/static/Shaun.jpg",
        "link": "https://twitter.com/shaundunne",
        "name": "Shaun Dunne",
        "title": "The Open Metaverse: VR for the Web",
        "text": "Unless you've been hiding under a rock for the past few years you've probably heard of VR. This is a talk about WebVR. Yes. VR on the Web, in your browser. Not only is it awesome to experience, it's fun and easy to experiment with and has a vast ecosystem already."
      },
      {
        "avatar": "/static/Federico.jpg",
        "link": "https://twitter.com/framp",
        "name": "Federico Rampazzo",
        "title": "Understanding Monads",
        "text": "Do you want to take your functional programming to the next level? Buckle up then, this talks is going to be a journey through the Fantasyland of Algebraic Data Structures. Never ask yourself how to implement and use Setoids, Functors or Monads again."
      }
    ]
  }
]
